OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  config_save_admin(quser, qpass);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void
handleSetTime(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  bool qsntp_enable = isPositive(request, "ntp");
  String qtz = request->getParam("tz");

  config_save_sntp(qsntp_enable, qtz);
  if(config_sntp_enabled()) {
    time_check_now();
  }

  if(false == qsntp_enable)
  {
    String time = request->getParam("time");

    struct tm tm;

    int yr, mnth, d, h, m, s;
    if(6 == sscanf( time.c_str(), "%4d-%2d-%2dT%2d:%2d:%2dZ", &yr, &mnth, &d, &h, &m, &s))
    {
      tm.tm_year = yr - 1900;
      tm.tm_mon = mnth - 1;
      tm.tm_mday = d;
      tm.tm_hour = h;
      tm.tm_min = m;
      tm.tm_sec = s;

      struct timeval set_time = {0,0};
      set_time.tv_sec = mktime(&tm);

      time_set_time(set_time, "manual");

    }
    else
    {
      response->setCode(400);
      response->print("could not parse time");
      request->send(response);
      return;
    }
  }

  response->setCode(200);
  response->print("set");
  request->send(response);
}

// -------------------------------------------------------------------
// Save advanced settings
// url: /saveadvanced
// -------------------------------------------------------------------
void
handleSaveAdvanced(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  String qhostname = request->getParam("hostname");
  String qsntp_host = request->getParam("sntp_host");

  config_save_advanced(qhostname, qsntp_host);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Save the Ohm keyto EEPROM
// url: /handleSaveOhmkey
// -------------------------------------------------------------------
void
handleSaveOhmkey(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  bool enabled = isPositive(request->getParam("enable"));
  String qohm = request->getParam("ohm");

  config_save_ohm(enabled, qohm);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void
handleStatus(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  // Get the current time
  struct timeval local_time;
  gettimeofday(&local_time, NULL);

  struct tm * timeinfo = gmtime(&local_time.tv_sec);

  char time[64];
  char offset[8];
  strftime(time, sizeof(time), "%FT%TZ", timeinfo);
  strftime(offset, sizeof(offset), "%z", timeinfo);

  const size_t capacity = JSON_OBJECT_SIZE(40) + 1024;
  DynamicJsonDocument doc(capacity);

  if (net_eth_connected()) {
    doc["mode"] = "Wired";
  } else if (net_wifi_mode_is_sta_only()) {
    doc["mode"] = "STA";
  } else if (net_wifi_mode_is_ap_only()) {
    doc["mode"] = "AP";
  } else if (net_wifi_mode_is_ap() && net_wifi_mode_is_sta()) {
    doc["mode"] = "STA+AP";
  }

  doc["wifi_client_connected"] = net_wifi_client_connected();
  doc["eth_connected"] = net_eth_connected();
  doc["net_connected"] = net_is_connected();
  doc["srssi"] = WiFi.RSSI();
  doc["ipaddress"] = ipaddress;

  doc["emoncms_connected"] = emoncms_connected;
  doc["packets_sent"] = packets_sent;
  doc["packets_success"] = packets_success;

  doc["mqtt_connected"] = mqtt_connected();

  doc["ohm_hour"] = ohm_hour;

  doc["free_heap"] = HAL.getFreeHeap();

  doc["comm_sent"] = rapiSender.getSent();
  doc["comm_success"] = rapiSender.getSuccess();
  doc["rapi_connected"] = rapiSender.isConnected();

  doc["amp"] = amp;
  doc["pilot"] = pilot;
  doc["temp1"] = temp1;
  doc["temp2"] = temp2;
  doc["temp3"] = temp3;
  doc["state"] = state;
  doc["elapsed"] = elapsed;
  doc["wattsec"] = wattsec;
  doc["watthour"] = watthour_total;

  doc["gfcicount"] = gfci_count;
  doc["nogndcount"] = nognd_count;
  doc["stuckcount"] = stuck_count;

  doc["divertmode"] = divertmode;
  doc["solar"] = solar;
  doc["grid_ie"] = grid_ie;
  doc["charge_rate"] = charge_rate;
  doc["divert_update"] = (millis() - lastUpdate) / 1000;

  doc["ota_update"] = Update.isRunning();
  doc["time"] = String(time);
  doc["offset"] = String(offset) + "\"";

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}

// -------------------------------------------------------------------
// Returns OpenEVSE Config json
// url: /config
// -------------------------------------------------------------------
void
handleConfig(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }
  
  const size_t capacity = JSON_OBJECT_SIZE(40) + 1024;
  DynamicJsonDocument doc(capacity);

  // EVSE Config
  doc["firmware"] = firmware;
  doc["protocol"] = protocol;
  doc["espflash"] = HAL.getFlashChipSize();
  doc["version"] = currentfirmware;
  doc["diodet"] = diode_ck;
  doc["gfcit"] = gfci_test;
  doc["groundt"] = ground_ck;
  doc["relayt"] = stuck_relay;
  doc["ventt"] = vent_ck;
  doc["tempt"] = temp_ck;
  doc["service"] = service;
  doc["scale"] = current_scale;
  doc["offset"] = current_offset;

  // Static supported protocols
  JsonArray mqtt_supported_protocols = doc.createNestedArray("mqtt_supported_protocols");
  mqtt_supported_protocols.add("mqtt");
  mqtt_supported_protocols.add("mqtts");

  JsonArray http_supported_protocols = doc.createNestedArray("http_supported_protocols");
  http_supported_protocols.add("http");
  http_supported_protocols.add("https");
  
  config_serialize(doc, true, false, true);
  doc["emoncms_enabled"]= config_emoncms_enabled();
  doc["mqtt_enabled"] = config_mqtt_enabled();
  doc["mqtt_reject_unauthorized"] = config_mqtt_reject_unauthorized();
  doc["sntp_enabled"]= config_sntp_enabled();
  doc["ohm_enabled"]= config_ohm_enabled();

  response->setCode(200);
  serializeJson(doc, *response);
  request->send(response);
}

#ifdef ENABLE_LEGACY_API
// -------------------------------------------------------------------
// Returns Updates JSON
// url: /rapiupdate
// -------------------------------------------------------------------
void
handleUpdate(MongooseHttpServerRequest *request) {

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

